Catalogs/КассовыеДаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КассовыеДаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

InformationRegisters/КассовыеДаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>КассовыеДаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстрономическаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КассоваяДата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассовыеДаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КассовыеДаты/Ext/ManagerModule.bsl
Функция ПолучитьДату(КассоваяДата) Экспорт
	
	Возврат РегистрыСведений.КассовыеДаты.ПолучитьДату(КассоваяДата);
	
КонецФункции // ПолучитьДату()

Процедура УстановитьДату(КассоваяДата, Дата, Отказ) Экспорт
	
	РегистрыСведений.КассовыеДаты.УстановитьДату(КассоваяДата, Дата, Отказ);
	
КонецПроцедуры // УстановитьДату()


Функция ПолучитьПараметрыКассовойДаты(КассоваяДата) Экспорт
	
	Возврат РегистрыСведений.КассовыеДаты.ПолучитьПараметрыКассовойДаты(КассоваяДата);
	
КонецФункции // ПолучитьПараметрыКассовойДаты()
